#Напишите программу, которая будет выводить на экран наиболее понравившееся вам высказывание, автором которого является Шамиль. 
#Не забудьте о том, что автор должен быть упомянут на отдельной строке.
# Нагребельный Ю.А., Вариант 16.
print("Боишься - не говори, сказал - не бойся!\n\t\t\t\t\tИ.Шамиль")
input("Нажмите ENTER для продолжения")
