#Напишите программу, которая будет сообщать род деятельности и псевдоним под которым скрывается Грета Густафсон. После вывода информации 
#программа должна дожидаться пока пользователь нажмет Enter для выхода.
# Нагребельный Ю.А., Вариант 16
print("Грета Густафсон - актриса, более известна как Грета Гарбо")
input("Нажмите ENTER для продолжения")
