#Напишите программу, которая выводит имя "Мария Луиза Полякова — Байдарова", и запрашивает его псевдоним. Программа должна сцеплять две 
#эти строки и выводить полученную строку, разделяя имя и псевдоним с помощью тире
# Нагребельный Ю.А., Вариант 16.
nick=input("Введите псевдоним Марии Луизы Полякова - Байдаровой: ")
name="Мария Луиза Полякова — Байдарова"
print(name+" - это "+nick)
input("Нажмите ENTER для продолжения")
